## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
gcdigital.ca.tf
```
```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_route53_record._domainconnect-gcdigital-ca-CNAME` |
|        | `aws_route53_record.ftp-gcdigital-ca-CNAME`            |
|        | `aws_route53_record.gcdigital-ca-A`                    |
|        | `aws_route53_record.gcdigital-ca-MX`                   |
|        | `aws_route53_record.gcdigital-ca-TXT`                  |
|        | `aws_route53_record.www-gcdigital-ca-CNAME`            |
|        | `aws_route53_zone.gcdigital-ca-public`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record._domainconnect-gcdigital-ca-CNAME will be created
  + resource "aws_route53_record" "_domainconnect-gcdigital-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_domainconnect.gcdigital.ca"
      + records         = [
          + "_domainconnect.gd.domaincontrol.com.gcdigital.ca.",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.ftp-gcdigital-ca-CNAME will be created
  + resource "aws_route53_record" "ftp-gcdigital-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ftp.gcdigital.ca"
      + records         = [
          + "gcdigital.ca.",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.gcdigital-ca-A will be created
  + resource "aws_route53_record" "gcdigital-ca-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gcdigital.ca"
      + records         = [
          + "184.168.221.58",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.gcdigital-ca-MX will be created
  + resource "aws_route53_record" "gcdigital-ca-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gcdigital.ca"
      + records         = [
          + "1 aspmx.l.google.com.gcdigital.ca.",
          + "10 aspmx2.googlemail.com.gcdigital.ca.",
          + "10 aspmx3.googlemail.com.gcdigital.ca.",
          + "5 alt1.aspmx.l.google.com.gcdigital.ca.",
          + "5 alt2.aspmx.l.google.com.gcdigital.ca.",
        ]
      + ttl             = 3600
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.gcdigital-ca-TXT will be created
  + resource "aws_route53_record" "gcdigital-ca-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gcdigital.ca"
      + records         = [
          + "google-site-verification=lLwNix6L6JswxsfIH6g_daOGy0hkTUw0Cc4aeFSLIH8",
          + "v=spf1 include:_spf.google.com ~all",
        ]
      + ttl             = 3600
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.www-gcdigital-ca-CNAME will be created
  + resource "aws_route53_record" "www-gcdigital-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.gcdigital.ca"
      + records         = [
          + "gcdigital.ca.",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.gcdigital-ca-public will be created
  + resource "aws_route53_zone" "gcdigital-ca-public" {
      + arn                 = (known after apply)
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "gcdigital.ca"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Project" = "dns"
        }
      + tags_all            = {
          + "Project" = "dns"
        }
      + zone_id             = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gcdigital-ca-ns       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.gcdigital-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
